0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    INLET
    {
        type            vtTtot;
        Ttot            300;
        value           uniform 300;
    }

    COLD
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    HOT
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    "(WALL|nozzle)"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
