0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value           uniform 1.0;
    }

    COLD
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
        value           uniform 1.0;
    }

    HOT
    {
        type            inletOutlet;
        inletValue      uniform 1.0;
        value           uniform 1.0;
    }

    "(WALL|nozzle)"
    {
        type            epsilonWallFunction;
        value           uniform 1.0;
    }
}


// ************************************************************************* //
