constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    INLET
    {
        type            patch;
        nFaces          252;
        startFace       428022;
    }
    COLD
    {
        type            patch;
        nFaces          532;
        startFace       428274;
    }
    HOT
    {
        type            patch;
        nFaces          448;
        startFace       428806;
    }
    WALL
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9116;
        startFace       429254;
    }
    nozzle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3316;
        startFace       438370;
    }
)

// ************************************************************************* //
