constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// simulationType    laminar;

simulationType    RAS;

RAS
{
    RASModel      kEpsilon;

    turbulence    on;

    printCoeffs   on;

    // kEpsilonCoeffs
    // {
    //     Cmu             0.09;
    //     C1              1.44;
    //     C2              1.92;
    //     C3              -0.33;
    //     sigmak          1;
    //     sigmaEps        1.3;
    //     Prt             0.9;
    // }
}

// ************************************************************************* //
